/*----------------------------------------------------------------------------------------------------
 #
 #	Copyright (c) 2022 Yuankang Liang(XerolySkinner)
 #
 #	本软件按原样提供,无任何明示或暗示
 #	在任何情况下,作者都不承担任何损害赔偿责任
 #
 #	使用的许可声明:
 #	1.	不得歪曲本软件的来源,你不能声称你编写了原始软件.
 #	2.	免费授予以任何目的,前提是版权声明出现在所有副本中.
 #		并且版权声明和许可声明同时出现.
 #	3.	你有使用,复制,修改,分发,和销售本软件的许可.
 #	4.	如果你在产品中使用,产品文档中的声明是赞赏的但不是必须的.
 #	5.	本通知不得从任何来源删除或更改.
 #
 #	Yuankang Liang(XerolySkinner)
 #		E-mail:zabbcccbbaz@163.com
 #		QQ:2715099320
 #		Mobile Phone:13005636215
 #
 #	All rights reserved.
 */

 /**
  * @file		bsp_SPI.h
  * @brief		SPI的库
  * @mainpage	主要信息
  * @author		Yuankang Liang(XerolySkinner)
  * @email		zabbcccbbaz@163.com
  * @version		V1.0.0
  * @date		Wed Mar  8 22:22:53 2023
  */
#ifndef _BSP_SPI_H
#define _BSP_SPI_H
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	头文件
#include <reg52.h>
#include <intrins.h>
#include "varint.h"
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	模式设置
#define		SPI_CPOL	0			///< SPISCK空闲极性
#define		SPI_CPHA	0			///< SPI读取边沿
#define		SPI_CS		0			///< SPI片选空闲极性
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	管脚定义3线制
/**
 * @todo 		定义SCK的管脚
 */
sbit SPI3_SCK_PIN = P3^6;			///< 定义SCK的管脚
/**
 * @todo 		定义SDA的管脚
 */
sbit SPI3_SDA_PIN = P3^4;			///< 定义SDA的管脚
/**
 * @todo 		定义RST的管脚
 */
sbit SPI3_RST_PIN = P3^5;			///< 定义RST的管脚
//----------------------------------------------------------------------------------------------------
//	管脚定义4线制
/**
 * @todo 		定义SCK的管脚
 */
sbit SPI4_SCK_PIN = P2^0;			///< 定义SCK的管脚
/**
 * @todo 		定义MOSI的管脚
 */
sbit SPI4_MOSI_PIN = P2^1;			///< 定义MOSI的管脚
/**
 * @todo 		定义MISO的管脚
 */
sbit SPI4_MISO_PIN = P2^2;			///< 定义MISO的管脚
/**
 * @todo 		定义CS的管脚
 */
sbit SPI4_CS_PIN = P2^3	;			///< 定义CS的管脚
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	函数
void SPI3_WriteOneByte(u8 address,u8 dat);
u8 SPI3_ReadOneByte(u8 address);
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	函数
#define	SPI4_ON()			SPI4_CS_PIN=!SPI_CS				///< SPI4开始通信
#define	SPI4_OFF()			SPI4_CS_PIN=SPI_CS				///< SPI4结束通信
void SPI4_Init(void);
u8 SPI4_Byte(u8 temp);
void SPI4_Data_WR(const char* format,...);
//----------------------------------------------------------------------------------------------------
#define SPI4_Delay()		do{_nop_();}while(0)
//////////////////////////////////////////////////////////////////////////////////////////////////////
#endif
