/*----------------------------------------------------------------------------------------------------
 #
 #	Copyright (c) 2022 Yuankang Liang(XerolySkinner)
 #
 #	本软件按原样提供,无任何明示或暗示
 #	在任何情况下,作者都不承担任何损害赔偿责任
 #
 #	使用的许可声明:
 #	1.	不得歪曲本软件的来源,你不能声称你编写了原始软件.
 #	2.	免费授予以任何目的,前提是版权声明出现在所有副本中.
 #		并且版权声明和许可声明同时出现.
 #	3.	你有使用,复制,修改,分发,和销售本软件的许可.
 #	4.	如果你在产品中使用,产品文档中的声明是赞赏的但不是必须的.
 #	5.	本通知不得从任何来源删除或更改.
 #
 #	Yuankang Liang(XerolySkinner)
 #		E-mail:zabbcccbbaz@163.com
 #		QQ:2715099320
 #		Mobile Phone:13005636215
 #
 #	All rights reserved.
 */

 /**
  * @file		bsp_UART.c
  * @brief		UART的51库
  * @mainpage	主要信息
  * @author		Yuankang Liang(XerolySkinner)
  * @email		zabbcccbbaz@163.com
  * @version		V1.0.0
  * @date		Wed Mar  8 22:35:42 2023

  */
#include "bsp_UART.h"
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	函数
/**
 * @brief			printf重定向,不要直接使用本函数
 * @param	temp 	要发送的一个字节
 * @return			无
 */
char putchar(char temp){
	SBUF = temp;
    while(!TI);
	TI = 0;
	return temp;}
//////////////////////////////////////////////////////////////////////////////////////////////////////
//----------------------------------------------------------------------------------------------------
//	初始化
/**
 * @brief			使用这个来初始化51单片机的串口,波特率9600bps
 * @return			无
 * @note			本串口设置将占用定时器1
 */
void UartInit_9600(void){		//9600bps@11.0592MHz
	PCON |= 0x80;				//使能波特率倍速位SMOD
	SCON = 0x50;				//8位数据,可变波特率
	TMOD &= 0x0F;				//设置定时器模式
	TMOD |= 0x20;				//设置定时器模式
	TL1 = 0xFA;					//设置定时初始值
	TH1 = 0xFA;					//设置定时重载值
	ET1 = 0;					//禁止定时器中断
	TR1 = 1;}					//定时器1开始计时
//////////////////////////////////////////////////////////////////////////////////////////////////////
